cfg/Tasks/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Task>
		<Properties>
			<Name>Задачи</Name>
			<Addressing>InformationRegister.РолиИИсполнители</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадачПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхУдержанийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаСверхурочныхЧасов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПремииРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевВОрганизациях</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.КомандировкиОрганизаций</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтсутствиеНаРаботеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускаОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cfg/Tasks/Задачи/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// По описателям состояния задачи (реквизитам адресации) формирует текст инфо-строки и важность сообщения
//
// Параметры
//	Исполнитель, Роль, Организация, Выполнена - реквизиты, влияющие на состояние задачи
//
// Возвращаемое значение:
//	Структура из двух строковых значений - ТекстСообщения и ВажностьСообщения
//
Функция ПолучитьОписаниеОбъекта(Исполнитель, Роль, Организация, Выполнена) Экспорт
	
	Если Выполнена Тогда
		ТекстСообщения		= НСтр("ru='Задача выполнена';uk='Задача виконана'");
	Иначе
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекстСообщения		= НСтр("ru='Задачу может выполнить только ';uk='Задачу може виконати тільки '") + Исполнитель;
		Иначе
			ОписаниеРоли = "";
			Если ЗначениеЗаполнено(Роль) Тогда
				ОписаниеРоли = НРег(Строка(Роль));
			Иначе
				ОписаниеРоли = НСтр("ru='кадровик или расчетчик';uk='кадровик або розраховувач'");
			КонецЕсли;
			
			ОписаниеОрганизации = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				ОписаниеОрганизации = " " + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("организации") + " " + Строка(Организация);
			КонецЕсли;
			
			ТекстСообщения		= НСтр("ru='Задачу может выполнить любой ';uk='Задачу може виконати будь-який '") + ОписаниеРоли + ОписаниеОрганизации;
			
			РеквизитыАдресации = Новый Структура;
			Для Каждого Реквизит Из Метаданные().РеквизитыАдресации Цикл
				РеквизитыАдресации.Вставить(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ВажностьСообщения	= "";
	
	Возврат Новый Структура("ТекстСообщения,ВажностьСообщения", ТекстСообщения, ВажностьСообщения)

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередВыполнением()
	
	// Исполнитель берется из параметра сеанса
	Если Исполнитель.Пустая() Тогда
		Исполнитель = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
